AUTO_config_TK_pesok/src/DataProcessors/ФС_РабочееМестоПроизводства/ФС_РабочееМестоПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ФС_РабочееМестоПроизводства</name>
  <tabularSections>
    <name>Ингридиенты</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

AUTO_config_TK_pesok/src/Enums/РежимыИспользованияАналогов/РежимыИспользованияАналогов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РежимыИспользованияАналогов</name>
  <comment>Режимы использования аналогов</comment>
  <enumValues>
    <name>Разрешить</name>
    <comment>Разрешить</comment>
  </enumValues>
  <enumValues>
    <name>Запретить</name>
    <comment>Запретить</comment>
  </enumValues>
  <enumValues>
    <name>ЗаменятьЦеликом</name>
    <comment>Заменять целиком</comment>
  </enumValues>
</mdclass:Enum>

AUTO_config_TK_pesok/src/Enums/РежимыРасчетаСписанияВПроизводство/РежимыРасчетаСписанияВПроизводство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РежимыРасчетаСписанияВПроизводство</name>
  <comment>Режимы расчета списания в производство</comment>
  <enumValues>
    <name>ПоНорме</name>
    <comment>По норме с перерачетом производства</comment>
  </enumValues>
  <enumValues>
    <name>ПоФакту</name>
    <comment>По факту с использованием текущих данных</comment>
  </enumValues>
</mdclass:Enum>

AUTO_config_TK_pesok/src/Enums/ВидыПроизводства/ВидыПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПроизводства</name>
  <comment>Виды производства</comment>
  <enumValues>
    <name>ВсеЗаготовки</name>
    <comment>Все заготовки</comment>
  </enumValues>
  <enumValues>
    <name>НехватающиеЗаготовки</name>
    <comment>Нехватающие заготовки</comment>
  </enumValues>
  <enumValues>
    <name>ЗаготовкиНеГотовятся</name>
    <comment>Заготовки не готовятся </comment>
  </enumValues>
</mdclass:Enum>

AUTO_config_TK_pesok/src/Documents/Рецептура/Рецептура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Рецептура</name>
  <comment>Рецептура (технологическая карта)</comment>
  <attributes>
    <name>Автор</name>
    <comment>Автор документа - пользователь, создавший документ.</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозОперация</name>
    <comment>Выполняемая документом операция</comment>
    <type>
      <types>CatalogRef.ХозОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеКомпании</name>
    <comment>Подразделение компании в котором был выписан документ</comment>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Произвольный комментарий к документу</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Продукция</name>
    <comment>Продукция, для которой собираем ингредиенты</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <comment>Количество продукции, которое может быть выпущено с указанными ингредиентами</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <comment>Единица измерения номенклатурной позиции</comment>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяРецептура</name>
    <comment>Признак основной рецептуры данной продукции. Основная рецептура может быть только одна</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТехнологияПроизводства</name>
    <comment>Технология производства</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаКачества</name>
    <comment>Оценка качества</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Вкус</name>
    <comment>Вкус</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Консистенция</name>
    <comment>Консистенция</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Коэффициент</name>
    <comment>Коэффициент пересчета по отношению к базовой единице номенклатуры</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Актуальная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормироватьВыпускПриЗагрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <comment>Таблица товаров и услуг</comment>
    <attributes>
      <name>Номенклатура</name>
      <comment>Номенклатура (товар, услуга и т.п.)</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>Количество брутто единиц измерения номенклатуры</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоНетто</name>
      <comment>Количество нетто единиц измерения номенклатуры</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <comment>Единица измерения номенклатурной позиции</comment>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <comment>Коэффициент пересчета по отношению к базовой единице номенклатуры</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентСебестоимости</name>
      <comment>Коэффициент себестоимости</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Рецептура</name>
      <type>
        <types>DocumentRef.Рецептура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗапретитьАвтовыборРецептуры</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТорговыеПлощадки</name>
    <attributes>
      <name>ТорговаяПлощадка</name>
      <type>
        <types>CatalogRef.ТорговыеПлощадки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

AUTO_config_TK_pesok/src/Catalogs/СкладыКомпании/СкладыКомпании.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СкладыКомпании</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Подразделение</name>
    <comment>Подразделение компании, к которому относится склад компании</comment>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>ТорговаяПлощадка</name>
    <type>
      <types>CatalogRef.ТорговыеПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦенСебестоимости</name>
    <comment>Тип цен из которых считается себестоимость когда не найдены партии при возвратах и прочих оприходованиях</comment>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦенРозничнойТорговли</name>
    <comment>Тип цен розничной торговли (для розничного склада)</comment>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Розничный</name>
    <comment>Истина - склад розничный, иначе - оптовый</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСклада</name>
    <type>
      <types>CatalogRef.ВидыСкладов</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Районы</name>
    <type>
      <types>CatalogRef.Районы</types>
    </type>
  </attributes>
  <attributes>
    <name>НеВестиУчетПоХарактеристикам</name>
    <comment>Устаревший, использовать вместо регистр &quot;ТК_УчетХарактеристикНаСкладах&quot;</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Global_ID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаДоставки</name>
    <comment>(АСУ by 4ок)</comment>
    <type>
      <types>CatalogRef.ТочкиДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Маршрут</name>
    <comment>Номер маршрута доставки (0 если склад не торгует)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АссортиментнаяМатрица</name>
    <type>
      <types>CatalogRef.АссортиментнаяМатрица</types>
    </type>
  </attributes>
  <attributes>
    <name>ТерриторияПоКОАТУУ</name>
    <comment>Название и код территории по КОАТУУ, на которой расположен склад (торговая точка)</comment>
    <type>
      <types>CatalogRef.КлассификаторКОАТУУ</types>
    </type>
  </attributes>
  <attributes>
    <name>НеАктивен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойСкладТорговойПлощадки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийСклад</name>
    <type>
      <types>CatalogRef.СкладыКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>ИД_Автомата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидАвтомата</name>
    <type>
      <types>CatalogRef.ВидыВендингАвтоматов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоступныеЦены</name>
    <attributes>
      <name>ТипЦен</name>
      <type>
        <types>CatalogRef.ТипыЦен</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

AUTO_config_TK_pesok/src/DataProcessors/ФС_РабочееМестоПроизводства/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПодразделениеКомпании = Справочники.ПодразделенияКомпании.НайтиПоКоду("000000006");
	Организация      = Справочники.Организации.НайтиПоКоду("GL000015");
	СкладОтправитель = Справочники.СкладыКомпании.НайтиПоКоду("удAT0013");
	СкладПолучатель  = Справочники.СкладыКомпании.НайтиПоКоду("удAT0016");
	ТорговаяПлощадка = Справочники.ТорговыеПлощадки.НайтиПоКоду("ХGL000281");
	
	ЗаполнитьТаблицуПеретаривания();
	СформироватьОтчетОстатки();
КонецПроцедуры


&НаКлиенте
Процедура ЗавершитьРаботуРабочегоМеста(Команда)		
	
	ЗавершитьРаботуСистемы(Истина, Ложь);
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовФормы

&НаСервере
Процедура НоменклатураВыпускаПриИзмененииНаСервере()
 
	тНоменклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",НоменклатураВыпуска);

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Рецептура.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ Вт_Рецептура
		|ИЗ
		|	Документ.Рецептура КАК Рецептура
		|ГДЕ
		|	Рецептура.Проведен
		|	И Рецептура.Продукция = &Продукция
		|	И Рецептура.Актуальная
		|
		|УПОРЯДОЧИТЬ ПО
		|	Рецептура.Дата УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РецептураТовары.Номенклатура КАК Номенклатура,
		|	РецептураТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	РецептураТовары.Коэффициент КАК Коэффициент,
		|	0 КАК Количество
		|ИЗ
		|	Вт_Рецептура КАК Вт_Рецептура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Рецептура.Товары КАК РецептураТовары
		|		ПО Вт_Рецептура.Ссылка = РецептураТовары.Ссылка.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	РецептураТовары.Ссылка.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Продукция", тНоменклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		ОбщегоНазначения.СообщитьПользователю("НЕТ актуальной рецептуры для данного товара");
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = Объект.Ингридиенты.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураВыпускаПриИзменении(Элемент)
	Объект.Ингридиенты.Очистить();
	
	НоменклатураВыпускаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ИнгридиентыНоменклатураПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Ингридиенты.ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПроверитьЗаполнитьЕдиницуИзмеренийПоВладельцу", ТекущаяСтрока.ЕдиницаИзмерения);
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПереработкиРасходНоменклатураПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ТаблицаПереработкиРасход.ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПроверитьЗаполнитьЕдиницуИзмеренийПоВладельцу", ТекущаяСтрока.ЕдиницаИзмерения);
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, Неопределено);

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПереработкиПриходНоменклатураПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ТаблицаПереработкиПриход.ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПроверитьЗаполнитьЕдиницуИзмеренийПоВладельцу", ТекущаяСтрока.ЕдиницаИзмерения);
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, Неопределено);

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаСервере
Процедура СформироватьОтчетОстатки()
	
    СхемаКомпоновкиДанных = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Остатки");
	
	Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
    ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	ПараметрыДанных = Настройки.ПараметрыДанных.Элементы;
	
	СписокСкладов = Новый СписокЗначений;
	СписокСкладов.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("удAT0015"));
	СписокСкладов.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("удAT0013"));
	
	ЭлементСкладыКомпании = ПараметрыДанных.Найти("СкладКомпании");
	ЭлементСкладыКомпании.Использование = Истина;
	ЭлементСкладыКомпании.Значение = СписокСкладов;

	ЭлементНачалоПериода = ПараметрыДанных.Найти("НачалоПериода");
	ЭлементНачалоПериода.Использование = Истина;
	ЭлементНачалоПериода.Значение = ТекущаяДатаСеанса()-7*24*3600;

	ЭлементКонецПериода = ПараметрыДанных.Найти("КонецПериода");
	ЭлементКонецПериода.Использование = Истина;
	ЭлементКонецПериода.Значение = ТекущаяДатаСеанса();

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
    
    ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(тОстатки);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных); 
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуПеретаривания()
	
	СписокНоменклатуры = новый СписокЗначений;
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", "12476")); 
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", "10370")); 
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", "10371")); 
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", "10372")); 
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", "10373")); 
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", "10616")); 
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", "10617")); 
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", "10618")); 
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", "10620")); 
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", "10371")); 
	
	Для Каждого стр из СписокНоменклатуры цикл
		НоваяСтрока = ТаблицаПеретарки.Добавить();
		НоваяСтрока.Номенклатура = стр.Значение;
	КонецЦикла;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПроверитьЗаполнитьЕдиницуИзмеренийПоВладельцу");
	
	ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(ТаблицаПеретарки, СтруктураДействий, Неопределено);
	
КонецПроцедуры

&НаСервере
Функция ПеретаритьНаСервере()
	НачатьТранзакцию();
	
	Док = Документы.ВыпускПродукции.СоздатьДокумент();
	Док.Дата 						 = ТекущаяДатаСеанса();
	Док.Автор 						 = Пользователи.ТекущийПользователь();
	Док.ЗакрытиеЗаказовПокупателей 	 = 1;
	Док.РежимИспользованияАналогов 	 = Перечисления.РежимыИспользованияАналогов.Разрешить;
	Док.РежимРасчетаСписанияВПроизводство = Перечисления.РежимыРасчетаСписанияВПроизводство.ПоФакту;
	Док.ВидПроизводства 			 = Перечисления.ВидыПроизводства.ЗаготовкиНеГотовятся;
	Док.УчитыватьОстаткиБлюдНаСкладе = Ложь;
	Док.РазрешитьНедовложения 		 = Ложь;
	Док.ХозОперация  				 = Справочники.ХозОперации.ВыпускПродукции;
	Док.ПодразделениеКомпании 		 = ПодразделениеКомпании;
	Док.СкладКомпании 				 = СкладПолучатель;
	Док.ТорговаяПлощадка			 = СкладПолучатель.ТорговаяПлощадка;
	Док.Организация 				 = Организация;
	Док.УстановитьНовыйНомер();
	
	Для Каждого стр Из ТаблицаПеретарки Цикл
		Если стр.Количество = 0 Тогда 
			Продолжить;
		КонецЕсли;
		
		Рецептура = Документы.Рецептура.ПолучитьАктуальнуюРецептуру(Стр.Номенклатура);
		
		НоваяСтрока = Док.Продукция.Добавить(); 
		НоваяСтрока.Номенклатура 	  = Стр.Номенклатура;
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Рецептура);
		НоваяСтрока.Количество 		  = Стр.Количество;
		НоваяСтрока.КоличествоБазовое = Стр.Количество;
		
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ПроверитьЗаполнитьРецептуру", Новый Структура("ПодразделениеКомпании", ПодразделениеКомпании));
		СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
		СтруктураДействий.Вставить("ПересчитатьСумму");
		СтруктураДействий.Вставить("ПересчитатьСуммуВсего");
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", "СуммаВсего");
		
		ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(НоваяСтрока, СтруктураДействий, Неопределено);
	КонецЦикла;
	
	Если Док.Продукция.Количество() = 0 Тогда 
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецЕсли;
	
	Документы.ВыпускПродукции.ПерезаполнитьИнгридиенты(Док);
		
	Док.Комментарий = "Перетаривание";
		
	Попытка
		Док.Записать(РежимЗаписиДокумента.Проведение);
		ОбщегоНазначения.СообщитьПользователю("Документ записан "+ док.Ссылка,Док.Ссылка);
		ЗафиксироватьТранзакцию();
				
		Для Каждого стр из ТаблицаПеретарки цикл
			Стр.Количество = 0 ;
		КонецЦикла;
		
		ДокументДляПечати = Док;
		
		Возврат Истина;
	Исключение
		ОбщегоНазначения.СообщитьПользователю("Не удалось провести документ" + ОписаниеОшибки());
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
	
		
КонецФункции

&НаКлиенте
Процедура Перетарить(Команда)
	
	ПечататьДок = ПеретаритьНаСервере();
	
	Если ПечататьДок Тогда 
		МассивДокументов = Новый Массив;
		МассивДокументов.Добавить(ДокументДляПечати);
		ПараметрыПечати = Новый Структура;
		
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.ВыпускПродукции", "Фасовка", МассивДокументов, ЭтаФорма, ПараметрыПечати);
		
	КонецЕсли;		
	
КонецПроцедуры

Процедура ПереработатьНаСервере()
	
	НачатьТранзакцию();
	
	Док = Документы.ТК_Переработка.СоздатьДокумент();
	Док.Дата 						 = ТекущаяДатаСеанса();
	Док.Автор 						 = Пользователи.ТекущийПользователь();
	Док.ХозОперация  				 = Справочники.ХозОперации.Переработка;
	Док.ПодразделениеКомпании 		 = ПодразделениеКомпании;
	Док.СкладКомпании 				 = СкладПолучатель;
	Док.ТорговаяПлощадка			 = СкладПолучатель.ТорговаяПлощадка;
	Док.Организация 				 = Организация;
	Док.УстановитьНовыйНомер();
	
	Продукция = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", НоменклатураВыпуска);
	Рецептура = Документы.Рецептура.ПолучитьАктуальнуюРецептуру(Продукция);
	
	Для Каждого стр из ТаблицаПереработкиРасход Цикл
		Если стр.Количество = 0 Тогда 
			Продолжить;
		Иначе
			НоваяСтрока = Док.Материалы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,стр);
		КонецЕсли;
	КонецЦикла;
	
	СтруктураДействий = Новый Структура;	
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");	

	ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(НоваяСтрока, СтруктураДействий, Неопределено);

	Для Каждого стр из ТаблицаПереработкиПриход Цикл
		Если стр.Количество = 0 Тогда 
			Продолжить;
		Иначе
			НоваяСтрока = Док.Продукция.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,стр);
		КонецЕсли;
	КонецЦикла;

	СтруктураДействий = Новый Структура;	
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСПоНоменклатуре");
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");	
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС");
	СтруктураДействий.Вставить("ПересчитатьСумму");

	ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(НоваяСтрока, СтруктураДействий, Неопределено);

	Док.Комментарий = Комментарий;
	
	Попытка
		Док.Записать(РежимЗаписиДокумента.Запись);
		ОбщегоНазначения.СообщитьПользователю("Документ записан "+ док.Ссылка,Док.Ссылка);
		
		ТаблицаПереработкиПриход.Очистить();
		ТаблицаПереработкиРасход.Очистить();
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОбщегоНазначения.СообщитьПользователю("Не удалось записать документ "+ОписаниеОшибки());
		ОтменитьТранзакцию();
	КонецПопытки;

	
КонецПроцедуры

&НаКлиенте
Процедура Переработать(Команда)
	Если НЕ ТаблицаПереработкиПриход.Количество() = 0 Или НЕ ТаблицаПереработкиРасход.Количество()=0 Тогда 
		ПереработатьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВыпуститьПродукциюНаСервере()
	
	НачатьТранзакцию();
	
	Док = Документы.ВыпускПродукции.СоздатьДокумент();
	Док.Дата 						 = ТекущаяДатаСеанса();
	Док.Автор 						 = Пользователи.ТекущийПользователь();
	Док.ЗакрытиеЗаказовПокупателей 	 = 1;
	Док.РежимИспользованияАналогов 	 = Перечисления.РежимыИспользованияАналогов.Разрешить;
	Док.РежимРасчетаСписанияВПроизводство = Перечисления.РежимыРасчетаСписанияВПроизводство.ПоФакту;
	Док.ВидПроизводства 			 = Перечисления.ВидыПроизводства.ЗаготовкиНеГотовятся;
	Док.УчитыватьОстаткиБлюдНаСкладе = Ложь;
	Док.РазрешитьНедовложения 		 = Ложь;
	Док.ХозОперация  				 = Справочники.ХозОперации.ВыпускПродукцииСПеремещением;
	Док.ПодразделениеКомпании 		 = ПодразделениеКомпании;
	Док.СкладКомпании 				 = СкладОтправитель;
	Док.ТорговаяПлощадка			 = ТорговаяПлощадка;
	Док.СкладКомпанииПолучатель 	 = СкладПолучатель;
	Док.ТорговаяПлощадкаПолучатель   = СкладПолучатель.ТорговаяПлощадка;
	Док.Организация 				 = Организация;
	Док.УстановитьНовыйНомер();
	
	Продукция = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", НоменклатураВыпуска);
	Рецептура = Документы.Рецептура.ПолучитьАктуальнуюРецептуру(Продукция);
	
	НоваяСтрока = Док.Продукция.Добавить(); 
	НоваяСтрока.Номенклатура 	  = Продукция;
	ЗаполнитьЗначенияСвойств(НоваяСтрока,Рецептура);
	НоваяСтрока.Количество 		  = ФактВыпуска;
	НоваяСтрока.КоличествоБазовое = ФактВыпуска;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПроверитьЗаполнитьРецептуру", Новый Структура("ПодразделениеКомпании", ПодразделениеКомпании));
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуВсего");
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", "СуммаВсего");

	ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(НоваяСтрока, СтруктураДействий, Неопределено);

	Документы.ВыпускПродукции.ПерезаполнитьИнгридиенты(Док);
	
	Для Каждого стр Из Объект.Ингридиенты Цикл
		СтрокаПродукции = Док.Ингредиенты.НайтиСтроки(Новый Структура("Номенклатура, Рецептура, Ингредиент", Продукция,Рецептура.Рецептура,стр.Номенклатура)); 
		
		Если  СтрокаПродукции.Количество() =  0 Тогда
			ДанныеПродукции = Док.Продукция[0];	
			ДанныеИнгредиент = Док.Ингредиенты.Добавить();			
			ЗаполнитьЗначенияСвойств(ДанныеИнгредиент, ДанныеПродукции, "Номенклатура, Рецептура");
			ДанныеИнгредиент.КоличествоНоменклатуры 		= ДанныеПродукции.Количество;
			ДанныеИнгредиент.ЕдиницаИзмеренияНоменклатуры 	= ДанныеПродукции.ЕдиницаИзмерения;
			ДанныеИнгредиент.КоэффициентНоменклатуры 		= ДанныеПродукции.Коэффициент;
			ДанныеИнгредиент.Ингредиент 					= стр.Номенклатура;
			ДанныеИнгредиент.ЕдиницаИзмеренияИнгредиента 	= стр.ЕдиницаИзмерения;
			ДанныеИнгредиент.КоэффициентИнгредиента 		= стр.Коэффициент;
			ДанныеИнгредиент.КоличествоИнгредиентаФакт 		= стр.Количество;
		Иначе
			СтрокаПродукции[0].КоличествоИнгредиентаФакт = стр.Количество; 
		КонецЕсли;
	КонецЦикла;
	
	
	Док.Комментарий = Продукция.Наименование;
	
	Попытка
		Док.Записать(РежимЗаписиДокумента.Запись);
		ОбщегоНазначения.СообщитьПользователю("Документ записан!!!");
		
		Объект.Ингридиенты.Очистить();
		ФактВыпуска = 0;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОбщегоНазначения.СообщитьПользователю("Не удалось записать документ "+ОписаниеОшибки());
		ОтменитьТранзакцию();
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыпуститьПродукцию(Команда)
	
	Если НЕ ФактВыпуска = 0 Тогда 
		ВыпуститьПродукциюНаСервере();
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнено поле Факт Выпуска",,"ФактВыпуска");
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти
